const blogData = {
  title: "طرق التهكير",
  subTitle: "تم تصميم مجموعتنا من الخدمات المميزة لمساعدتك لتحقيق هدفك .",
  intro:
    "وتهكير الجهاز يكون عن طريق ارسال باتش او سيرفر -(طبعا السيرفرات لها اقسام كثيره , واقواها الكلين) طبعا السيرفر بيكون مشفر وعلى حسب الي شفره -(فيه تشفيرات تدعس كل الحمايات , وكذا الحمايه ماتكشفها) ومو اي واحد يقدر يكون هكر , لازم يتعلم اشياء كثيره قبل لايكون هكر مبتدئ وليس محترف ! بعنب لازم الهكر يكون فاهم طرق الحمايه من الهكر الآخرين , ثم يفتح بورت بجدار الحمايه والمودم او من التورنيت طبعا فايدت فتح البورت هي وصول الإتصال العكسي تبيع السيرفر حق الفتحه الضحيه ولا يمكن لهكر تهكير اي واحد إلا بفتح بورت . -(والبورت له عدة اقسام , واغلبها يكون 81 لأغلب برامج الإختراق , لكن يستطيع تغييره) وبرامج التهكير كثيره جدا , بس عملها واحد . مع اختلاف خصائص قليله واشهر برنامج اختراق الاجهزه هو Bifrost بلا منازع . -(وفيه برامج اخرى مثل spynet و njRAT وغيررها الكثير) طبعا البرامج تتحكم بالجهاز تحكم كامل . -(مثل فتح الكام و مراقبة شاشة الجهاز و التحكم الكامل بالملفات يتضمن النسخ,القص,الحذف و التحكم بأوامر التشغيل و اطفاء الجهاز وتشغيله) وكل برنامج له اعداداته وتختلف بسهولة الإستخدام فقط . واي سيرفر لازم ينزل في هذه الماكن فقط . -( %TEMP% او %AppData% او %UserProfile% او %ProgramData% او %System% ) طبعا الملفات هذي تكون مخفيه دائما . والسيرفر غالبا مايكون الامتداد حقه .exe حتى لو تغيرت الايقونه لـ صوره , فهو يبقى سيرفر وفيه بعض البرامج بتغير الامتداد حقه , مثلا بيكون .scr او غيرها . او إذا كان محترف بيدمجها بـ صوره او برنامج حقيقي . والبرنامج بيشتغل معك تمام بس بيهكر جهازك - وتهكير المواقع مالكم فيه , بس شرح سريع له طبعا محد يهكر المواقع إلا وهو محترف وعنده ضحايا بالهبل فيجمع معه اجهزه كثيره تتجاوز الـ5 آلاف جهاز طبعا الكل بيندهش وبيقول كيف يجيب 5 آلاف جهاز مهكر طبعا مافيه شي صعب بعالم الهكرز , وبكل بساطه يروح لمواقع حقت تحميل البرامج وفيه مواقع تتيح لأي واحد يرفع اي برنامج بموقعها طبعا التحميلات هناك بتكون كبيره , يعني اقل شي 1000 واحد يحملون السيرفر حق الهكر للبرنامج الواحد , ولو كان عايز ضحايا اكثر يعمل له برامج اخرى او يسمي السيرفر بإسم برنامج مشهور جدا مثل HotSpot الي الكل بيبحث عنه - اجانب , عرب . وكذا بيجمع الضحايا الكثيره وبيفتح اجهزتهم وبيوجهها على رابط الموقع بنفس الوقت كذا الموقع بيثقل وبيعلق وبيكون فيه ثغرات ويضبط برنامج المهاجمه ويهكر الموقع ويحفظ منه نسخة ست اب وبس . إلا إذا كان الموقع كبيره وله حمايات قويه ويستوعب اجهزه كبيره جدا . طبعا طرق الحماية من السيرفرات المشفره التي لا تكشفها برامج الفيروسات لها عدة طرق منها :- 1- فحصها بموقع فحص . 2- فحصها بأقوى واضمن موقع .(تتأخر بالبدايه شوي) 3- كشفها ببرامج قويه .",
  imgSrc: "",
  body: "وتهكير الجهاز يكون عن طريق ارسال باتش او سيرفر -(طبعا السيرفرات لها اقسام كثيره , واقواها الكلين) طبعا السيرفر بيكون مشفر وعلى حسب الي شفره -(فيه تشفيرات تدعس كل الحمايات , وكذا الحمايه ماتكشفها) ومو اي واحد يقدر يكون هكر , لازم يتعلم اشياء كثيره قبل لايكون هكر مبتدئ وليس محترف ! بعنب لازم الهكر يكون فاهم طرق الحمايه من الهكر الآخرين , ثم يفتح بورت بجدار الحمايه والمودم او من التورنيت طبعا فايدت فتح البورت هي وصول الإتصال العكسي تبيع السيرفر حق الفتحه الضحيه ولا يمكن لهكر تهكير اي واحد إلا بفتح بورت . -(والبورت له عدة اقسام , واغلبها يكون 81 لأغلب برامج الإختراق , لكن يستطيع تغييره) وبرامج التهكير كثيره جدا , بس عملها واحد . مع اختلاف خصائص قليله واشهر برنامج اختراق الاجهزه هو Bifrost بلا منازع . -(وفيه برامج اخرى مثل spynet و njRAT وغيررها الكثير) طبعا البرامج تتحكم بالجهاز تحكم كامل . -(مثل فتح الكام و مراقبة شاشة الجهاز و التحكم الكامل بالملفات يتضمن النسخ,القص,الحذف و التحكم بأوامر التشغيل و اطفاء الجهاز وتشغيله) وكل برنامج له اعداداته وتختلف بسهولة الإستخدام فقط . واي سيرفر لازم ينزل في هذه الماكن فقط . -( %TEMP% او %AppData% او %UserProfile% او %ProgramData% او %System% ) طبعا الملفات هذي تكون مخفيه دائما . والسيرفر غالبا مايكون الامتداد حقه .exe حتى لو تغيرت الايقونه لـ صوره , فهو يبقى سيرفر وفيه بعض البرامج بتغير الامتداد حقه , مثلا بيكون .scr او غيرها . او إذا كان محترف بيدمجها بـ صوره او برنامج حقيقي . والبرنامج بيشتغل معك تمام بس بيهكر جهازك - وتهكير المواقع مالكم فيه , بس شرح سريع له طبعا محد يهكر المواقع إلا وهو محترف وعنده ضحايا بالهبل فيجمع معه اجهزه كثيره تتجاوز الـ5 آلاف جهاز طبعا الكل بيندهش وبيقول كيف يجيب 5 آلاف جهاز مهكر طبعا مافيه شي صعب بعالم الهكرز , وبكل بساطه يروح لمواقع حقت تحميل البرامج وفيه مواقع تتيح لأي واحد يرفع اي برنامج بموقعها طبعا التحميلات هناك بتكون كبيره , يعني اقل شي 1000 واحد يحملون السيرفر حق الهكر للبرنامج الواحد , ولو كان عايز ضحايا اكثر يعمل له برامج اخرى او يسمي السيرفر بإسم برنامج مشهور جدا مثل HotSpot الي الكل بيبحث عنه - اجانب , عرب . وكذا بيجمع الضحايا الكثيره وبيفتح اجهزتهم وبيوجهها على رابط الموقع بنفس الوقت كذا الموقع بيثقل وبيعلق وبيكون فيه ثغرات ويضبط برنامج المهاجمه ويهكر الموقع ويحفظ منه نسخة ست اب وبس . إلا إذا كان الموقع كبيره وله حمايات قويه ويستوعب اجهزه كبيره جدا . طبعا طرق الحماية من السيرفرات المشفره التي لا تكشفها برامج الفيروسات لها عدة طرق منها :- 1- فحصها بموقع فحص . 2- فحصها بأقوى واضمن موقع .(تتأخر بالبدايه شوي) 3- كشفها ببرامج قويه .",
};

function BlogPage() {
  const { title, subTitle, intro, imgSrc, body } = blogData;
  return (
    <div className="mb-[100px]">
      {/* head */}
      <div className="mb-8">
        <div className="flex justify-between items-center mb-4">
          <h1 className="text-white  font-semibold text-3xl leading-normal">
            {title}
          </h1>
          <span className="opacity-75 bg-gradient-to-r from-opacity-50 via-transparent to-transparent h-[1px]" />
        </div>
        <p className="text-gray-300  font-semibold text-base leading-[1.33] tracking-tighter">
          {subTitle}
        </p>
      </div>
      {/* intro */}
      <p className="text-white mb-[42px] font-semibold text-base leading-[1.61]">
        {intro}
      </p>
      {/* image */}
      <div className="bg-gray-300 h-[407px] mb-[42px]">
        img palce
        {/* <img src={imgSrc} alt={title} className="w-full object-cover h-[407px]" /> */}
      </div>
      {/* body */}
      <p className="text-white mb-[42px] font-semibold text-base leading-[1.61]">
        {body}
      </p>
    </div>
  );
}

export default BlogPage;
